money2, p50000, p10000, p5000, p1000 = 0,0,0,0,0

money2 = int(input("지폐로 교환할 돈은 얼마?"))

p50000 = money2 // 50000
money2 %= 50000

p10000 = money2 // 10000
money2 %= 10000

p5000 = money2 // 5000
money2 %= 5000

p1000 = money2 // 1000
money2 %= 1000

print("\n50000원짜리 => %d장" %p50000)
print("10000원짜리 => %d장" %p10000)
print("5000원짜리 => %d장" %p5000)
print("1000원짜리 => %d장" %p1000)
print("지폐로 바꾸지 못한 돈 => %d원" %money2)


money = int(input("지폐로 교환할 돈은 얼마?")) 
print( "\n50000원짜리 ==>" , money//50000, "장")
print( "10000원짜리 ==>" , (money%50000) // 10000 , "장")
print( "5000원짜리 ==>" , (money%10000) // 5000 , "장")
print( "1000원짜리 ==>" , (money%5000) // 1000, "장")
print( "지폐로 바꾸지 못한 돈 ==>" , (money%1000) // 1, "장" )

